;;; packages.el -*- lexical-binding: t; -*-

(depends-on! :completion company)
(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)
(when (featurep! +debugging)
  (package! dap-mode))
(when (featurep! +cc)
  (depends-on! :feature snippets)
  (package! cmake-mode)
  (package! cuda-mode)
  (package! demangle-mode)
  (package! disaster)
  (package! modern-cpp-font-lock)
  (package! clang-format)
  (package! cquery))
(when (featurep! +java)
  (package! lsp-java))
(when (featurep! +haskell)
  (package! lsp-haskell))
(when (featurep! +groovy)
  (package! groovy-mode))
